Repository: cs100591/approv-now
Catalog: lib/l10n/app_*.arb
Languages: ms, th

source: Language
ms: Bahasa
th: ภาษา

source: Select Language
ms: Pilih Bahasa
th: เลือกภาษา

source: Dashboard
ms: Papan Pemuka
th: แดชบอร์ด

source: Workspaces
ms: Ruang Kerja
th: พื้นที่ทำงาน

source: Profile
ms: Profil
th: โปรไฟล์

source: Account
ms: Akaun
th: บัญชี

source: Cancel
ms: Batal
th: ยกเลิก

source: Save
ms: Simpan
th: บันทึก

source: Delete
ms: Padam
th: ลบ

source: Create
ms: Cipta
th: สร้าง

source: Submit
ms: Hantar
th: ส่ง

source: Edit
th: แก้ไข

source: Add
ms: Tambah
th: เพิ่ม

source: Remove
ms: Buang
th: นำออก

source: Confirm
ms: Sahkan
th: ยืนยัน

source: Back
ms: Kembali
th: ย้อนกลับ

source: Next
ms: Seterusnya
th: ถัดไป

source: Done
ms: Selesai
th: เสร็จสิ้น

source: Close
ms: Tutup
th: ปิด

source: Retry
ms: Cuba Semula
th: ลองอีกครั้ง

source: Loading...
ms: Memuatkan...
th: กำลังโหลด...

source: Error
ms: Ralat
th: ข้อผิดพลาด

source: Success
ms: Berjaya
th: สำเร็จ

source: Warning
ms: Amaran
th: คำเตือน

source: Info
ms: Maklumat
th: ข้อมูล

source: Yes
ms: Ya
th: ใช่

source: No
ms: Tidak
th: ไม่

source: OR
ms: ATAU
th: หรือ

source: and
ms: dan
th: และ

source: Email
ms: Emel
th: อีเมล

source: Password
ms: Kata Laluan
th: รหัสผ่าน

source: Name
ms: Nama
th: ชื่อ

source: Description
ms: Penerangan
th: รายละเอียด

source: Settings
ms: Tetapan
th: การตั้งค่า

source: Notifications
ms: Pemberitahuan
th: การแจ้งเตือน

source: Logout
ms: Log Keluar
th: ออกจากระบบ

source: Login
ms: Log Masuk
th: เข้าสู่ระบบ

source: Register
ms: Daftar
th: ลงทะเบียน

source: Sign In
ms: Log Masuk
th: เข้าสู่ระบบ

source: Sign Out
ms: Log Keluar
th: ออกจากระบบ

source: Create Account
ms: Cipta Akaun
th: สร้างบัญชี

source: Forgot Password?
ms: Lupa Kata Laluan?
th: ลืมรหัสผ่าน?

source: Reset Password
ms: Tetapkan Semula Kata Laluan
th: รีเซ็ตรหัสผ่าน

source: Change Password
ms: Tukar Kata Laluan
th: เปลี่ยนรหัสผ่าน

source: Current Password
ms: Kata Laluan Semasa
th: รหัสผ่านปัจจุบัน

source: New Password
ms: Kata Laluan Baru
th: รหัสผ่านใหม่

source: Confirm Password
ms: Sahkan Kata Laluan
th: ยืนยันรหัสผ่าน

source: Full Name
ms: Nama Penuh
th: ชื่อเต็ม

source: Display Name
ms: Nama Paparan
th: ชื่อที่แสดง

source: Not logged in
ms: Belum Log Masuk
th: ยังไม่ได้เข้าสู่ระบบ

source: No Name
ms: Tiada Nama
th: ไม่มีชื่อ

source: Sign in to your account
ms: Log masuk ke akaun anda
th: เข้าสู่บัญชีของคุณ

# signUpToGetStarted
source: Sign up to get started with Approve Now
ms: Daftar untuk mula menggunakan Approve Now
th: ลงทะเบียนเพื่อเริ่มต้นใช้งาน Approve Now

source: Enter your email
ms: Masukkan emel anda
th: กรอกอีเมลของคุณ

source: Enter your password
ms: Masukkan kata laluan anda
th: กรอกรหัสผ่านของคุณ

source: Enter your full name
ms: Masukkan nama penuh anda
th: กรอกชื่อเต็มของคุณ

source: Your name
ms: Nama anda
th: ชื่อของคุณ

source: Email is required
ms: Emel diperlukan
th: จำเป็นต้องกรอกอีเมล

# pleaseEnterValidEmail
source: Please enter a valid email
ms: Sila masukkan emel yang sah
th: กรุณากรอกอีเมลที่ถูกต้อง

source: Password is required
ms: Kata laluan diperlukan
th: จำเป็นต้องกรอกรหัสผ่าน

# passwordMinLength
source: Password must be at least 6 characters
ms: Kata laluan mestilah sekurang-kurangnya 6 aksara
th: รหัสผ่านต้องมีอย่างน้อย 6 ตัวอักษร

source: Name is required
ms: Nama diperlukan
th: จำเป็นต้องกรอกชื่อ

source: Please confirm your password
ms: Sila sahkan kata laluan anda
th: กรุณายืนยันรหัสผ่านของคุณ

source: Passwords do not match
ms: Kata laluan tidak sepadan
th: รหัสผ่านไม่ตรงกัน

source: Account created successfully!
ms: Akaun berjaya dicipta!
th: สร้างบัญชีสำเร็จ!

# registrationTimedOut
source: Registration timed out. Please try again.
ms: Pendaftaran tamat masa. Sila cuba lagi.
th: การลงทะเบียนหมดเวลา กรุณาลองอีกครั้ง

source: Enable Biometric Login?
ms: Dayakan Log Masuk Biometrik?
th: เปิดใช้งานการเข้าสู่ระบบด้วยชีวมิติ?

# biometricLoginDescription
source: Would you like to enable fingerprint or face ID for quick login?
ms: Adakah anda mahu mendayakan cap jari atau Face ID untuk log masuk pantas?
th: คุณต้องการเปิดใช้งานลายนิ้วมือหรือ Face ID เพื่อเข้าสู่ระบบอย่างรวดเร็วหรือไม่?

source: Not Now
ms: Bukan Sekarang
th: ไม่ใช่ตอนนี้

source: Enable
ms: Dayakan
th: เปิดใช้งาน

source: Biometric Login
ms: Log Masuk Biometrik
th: การเข้าสู่ระบบด้วยชีวมิติ

source: Use Biometric
ms: Gunakan Biometrik
th: ใช้ชีวมิติ

source: Fingerprint
ms: Cap Jari
th: ลายนิ้วมือ

# biometricEnabled
source: Biometric login enabled
ms: Log masuk biometrik didayakan
th: เปิดใช้งานการเข้าสู่ระบบด้วยชีวมิติแล้ว

# biometricDisabled
source: Biometric login disabled
ms: Log masuk biometrik dilumpuhkan
th: ปิดใช้งานการเข้าสู่ระบบด้วยชีวมิติแล้ว

# dontHaveAccount
source: Don't have an account?
ms: Tiada akaun?
th: ยังไม่มีบัญชี?

# alreadyHaveAccount
source: Already have an account?
ms: Sudah mempunyai akaun?
th: มีบัญชีอยู่แล้ว?

# logOutConfirmation
source: Are you sure you want to log out?
ms: Adakah anda pasti mahu log keluar?
th: คุณแน่ใจหรือไม่ว่าต้องการออกจากระบบ?

source: Log Out
ms: Log Keluar
th: ออกจากระบบ

source: Profile updated successfully
ms: Profil berjaya dikemas kini
th: อัปเดตโปรไฟล์สำเร็จ

# failedToUpdateProfile
source: Failed to update profile: {error}
ms: Gagal mengemas kini profil: {error}
th: ไม่สามารถอัปเดตโปรไฟล์: {error}

source: Settings coming soon
ms: Tetapan akan datang tidak lama lagi
th: การตั้งค่าจะเปิดใช้งานเร็วๆ นี้

source: Coming soon
ms: Akan Datang
th: เร็วๆ นี้

# copyright
source: © {year} Approve Now. All rights reserved.
ms: © {year} Approve Now. Hak Cipta Terpelihara.
th: © {year} Approve Now. สงวนลิขสิทธิ์.

source: Workspace
ms: Ruang Kerja
th: พื้นที่ทำงาน

source: Manage Workspaces
ms: Urus Ruang Kerja
th: จัดการพื้นที่ทำงาน

source: Join Workspace
ms: Sertai Ruang Kerja
th: เข้าร่วมพื้นที่ทำงาน

source: Create Workspace
ms: Cipta Ruang Kerja
th: สร้างพื้นที่ทำงาน

source: Switch Workspace
ms: Tukar Ruang Kerja
th: สลับพื้นที่ทำงาน

source: Workspace Name
ms: Nama Ruang Kerja
th: ชื่อพื้นที่ทำงาน

# workspaceDescription
source: Description (Optional)
ms: Penerangan (Pilihan)
th: รายละเอียด (ไม่บังคับ)

source: My Company
ms: Syarikat Saya
th: บริษัทของฉัน

source: Brief description
ms: Penerangan ringkas
th: รายละเอียดสั้นๆ

source: No Workspaces
ms: Tiada Ruang Kerja
th: ไม่มีพื้นที่ทำงาน

# createFirstWorkspace
source: Create your first workspace to get started
ms: Cipta ruang kerja pertama anda untuk bermula
th: สร้างพื้นที่ทำงานแรกของคุณเพื่อเริ่มต้น

# settingUpWorkspace
source: Setting up your workspace...
ms: Sedang menyiapkan ruang kerja anda...
th: กำลังตั้งค่าพื้นที่ทำงานของคุณ...

# loadingWorkspace
source: Loading your workspace...
ms: Memuatkan ruang kerja anda...
th: กำลังโหลดพื้นที่ทำงานของคุณ...

source: Workspace Limit Reached
ms: Had Ruang Kerja Dicapai
th: ถึงขีดจำกัดพื้นที่ทำงาน

# workspaceLimitMessage
source: You need to upgrade your plan to create more workspaces.
ms: Anda perlu menaik taraf pelan anda untuk mencipta lebih banyak ruang kerja.
th: คุณต้องอัปเกรดแผนของคุณเพื่อสร้างพื้นที่ทำงานเพิ่ม

# workspaceLimitReachedMessage
source: You've reached the maximum number of workspaces allowed by your plan.
ms: Anda telah mencapai bilangan ruang kerja maksimum yang dibenarkan oleh pelan anda.
th: คุณถึงจำนวนพื้นที่ทำงานสูงสุดที่แผนของคุณอนุญาต

# defaultWorkspaceCreated
source: Welcome! Default workspace created successfully.
ms: Selamat Datang! Ruang kerja lalai berjaya dicipta.
th: ยินดีต้อนรับ! สร้างพื้นที่ทำงานเริ่มต้นสำเร็จ

# failedToCreateWorkspace
source: Failed to create workspace. Please try again.
ms: Gagal mencipta ruang kerja. Sila cuba lagi.
th: ไม่สามารถสร้างพื้นที่ทำงาน กรุณาลองอีกครั้ง

source: No Workspace Found
ms: Tiada Ruang Kerja Ditemui
th: ไม่พบพื้นที่ทำงาน

# noWorkspaceFoundMessage
source: Unable to create a workspace at this time.
ms: Tidak dapat mencipta ruang kerja pada masa ini.
th: ไม่สามารถสร้างพื้นที่ทำงานได้ในขณะนี้

# createFirstWorkspaceButton
source: Create Workspace
ms: Cipta Ruang Kerja
th: สร้างพื้นที่ทำงาน

source: Workspace created successfully
ms: Ruang kerja berjaya dicipta
th: สร้างพื้นที่ทำงานสำเร็จ

# switchedToWorkspace
source: Switched to {workspaceName}
ms: Bertukar ke {workspaceName}
th: เปลี่ยนไปยัง {workspaceName}

source: Active
ms: Aktif
th: ใช้งานอยู่

source: Create New Workspace
ms: Cipta Ruang Kerja Baru
th: สร้างพื้นที่ทำงานใหม่

source: Team Members
ms: Ahli Pasukan
th: สมาชิกทีม

source: Invite New Member
ms: Jemput Ahli Baru
th: เชิญสมาชิกใหม่

source: No Workspace Selected
ms: Tiada Ruang Kerja Dipilih
th: ยังไม่ได้เลือกพื้นที่ทำงาน

# selectWorkspaceFirst
source: Please select a workspace first
ms: Sila pilih ruang kerja terlebih dahulu
th: กรุณาเลือกพื้นที่ทำงานก่อน

source: Pending Invitation
ms: Jemputan Tertunda
th: คำเชิญที่รอดำเนินการ

source: Change Role
ms: Tukar Peranan
th: เปลี่ยนบทบาท

source: Remove Member
ms: Buang Ahli
th: นำสมาชิกออก

# removeMemberConfirmation
source: Are you sure you want to remove {memberEmail}?
ms: Adakah anda pasti mahu membuang {memberEmail}?
th: คุณแน่ใจหรือไม่ว่าต้องการนำ {memberEmail} ออก?

# cannotRemovePending
source: Cannot remove pending invitation from here
ms: Tidak boleh membuang jemputan tertunda dari sini
th: ไม่สามารถนำคำเชิญที่รอดำเนินการออกจากที่นี่ได้

# memberRemoved
source: {memberEmail} removed
ms: {memberEmail} telah dibuang
th: นำ {memberEmail} ออกแล้ว

# changeRoleForMember
source: Change Role for {memberEmail}
ms: Tukar Peranan untuk {memberEmail}
th: เปลี่ยนบทบาทสำหรับ {memberEmail}

source: Generate Invite Code
ms: Jana Kod Jemputan
th: สร้างรหัสเชิญ

# generateInviteCodeDescription
source: Generate a 6-character invite code for team members to join.
ms: Jana kod jemputan 6 aksara untuk ahli pasukan menyertai.
th: สร้างรหัสเชิญ 6 ตัวอักษรให้สมาชิกทีมเข้าร่วม

source: Code Details
ms: Butiran Kod
th: รายละเอียดรหัส

# codeDetailsDescription
source: • Valid for 24 hours • Can be used by multiple people • New members join as Viewer role
ms: • Sah selama 24 jam • Boleh digunakan oleh beberapa orang • Ahli baru menyertai sebagai peranan Pelihat
th: • ใช้งานได้ 24 ชั่วโมง • สามารถใช้ได้หลายคน • สมาชิกใหม่เข้าร่วมในฐานะผู้ดู

source: Generate Code
ms: Jana Kod
th: สร้างรหัส

source: Invite Code Generated
ms: Kod Jemputan Dijana
th: สร้างรหัสเชิญสำเร็จ

# expires
source: Expires: {date}
ms: Tamat: {date}
th: หมดอายุ: {date}

# shareCodeDescription
source: Share this code with team members to invite them to your workspace.
ms: Kongsi kod ini dengan ahli pasukan untuk menjemput mereka ke ruang kerja anda.
th: แชร์รหัสนี้กับสมาชิกทีมเพื่อเชิญพวกเขาเข้าร่วมพื้นที่ทำงาน

source: Copy Code
ms: Salin Kod
th: คัดลอกรหัส

source: Code copied to clipboard
ms: Kod disalin ke papan keratan
th: คัดลอกรหัสไปยังคลิปบอร์ดแล้ว

source: Team Member Limit Reached
ms: Had Ahli Pasukan Dicapai
th: ถึงขีดจำกัดสมาชิกทีม

# teamMemberLimitMessage
source: You've reached the maximum number of team members allowed by your plan.
ms: Anda telah mencapai bilangan ahli pasukan maksimum yang dibenarkan oleh pelan anda.
th: คุณถึงจำนวนสมาชิกทีมสูงสุดที่แผนของคุณอนุญาต

# emailNotificationsDisabled
source: Email notifications are currently disabled. Team members will need to check the app for invitations.
ms: Pemberitahuan emel sedang dilumpuhkan. Ahli pasukan perlu menyemak aplikasi untuk jemputan.
th: การแจ้งเตือนทางอีเมลถูกปิดใช้งานในขณะนี้ สมาชิกทีมจะต้องตรวจสอบในแอปสำหรับคำเชิญ

source: Templates
ms: Templat
th: เทมเพลต

source: Template
ms: Templat
th: เทมเพลต

source: New Template
ms: Templat Baharu
th: เทมเพลตใหม่

source: Create Template
ms: Cipta Templat
th: สร้างเทมเพลต

source: No Templates
ms: Tiada Templat
th: ไม่มีเทมเพลต

# createFirstTemplate
source: Create your first template to get started
ms: Cipta templat pertama anda untuk bermula
th: สร้างเทมเพลตแรกของคุณเพื่อเริ่มต้น

# contactAdminToCreateTemplate
source: Contact workspace admin to create templates
ms: Hubungi pentadbir ruang kerja untuk mencipta templat
th: ติดต่อผู้ดูแลพื้นที่ทำงานเพื่อสร้างเทมเพลต

# templateFields
source: Form Fields
ms: Medan Borang
th: ฟิลด์แบบฟอร์ม

# templateApprovalSteps
source: Approval Steps
ms: Langkah Kelulusan
th: ขั้นตอนการอนุมัติ

source: Template Information
ms: Maklumat Templat
th: ข้อมูลเทมเพลต

# basicDetails
source: Basic details about this template
ms: Butiran asas tentang templat ini
th: รายละเอียดพื้นฐานเกี่ยวกับเทมเพลตนี้

source: Template Name
ms: Nama Templat
th: ชื่อเทมเพลต

# templateDescription
source: Description
ms: Penerangan
th: รายละเอียด

# defineFormFields
source: Define the fields users will fill out
ms: Tentukan medan yang akan diisi oleh pengguna
th: กำหนดฟิลด์ที่ผู้ใช้จะกรอก

source: No fields yet
ms: Tiada medan lagi
th: ยังไม่มีฟิลด์

# addFirstField
source: Tap + to add your first field or use AI to generate
ms: Tekan + untuk menambah medan pertama anda atau gunakan AI untuk menjana
th: แตะ + เพื่อเพิ่มฟิลด์แรกของคุณหรือใช้ AI เพื่อสร้าง

# whoNeedsToApprove
source: Who needs to approve this request?
ms: Siapa yang perlu meluluskan permohonan ini?
th: ใครต้องอนุมัติคำขอนี้?

source: No approval steps
ms: Tiada langkah kelulusan
th: ไม่มีขั้นตอนการอนุมัติ

source: Add at least one approver
ms: Tambah sekurang-kurangnya seorang pelulus
th: เพิ่มผู้อนุมัติอย่างน้อยหนึ่งคน

source: Text
ms: Teks
th: ข้อความ

source: Multiline
ms: Berbilang Baris
th: หลายบรรทัด

source: Number
ms: Nombor
th: ตัวเลข

source: Currency
ms: Mata Wang
th: สกุลเงิน

source: Date
ms: Tarikh
th: วันที่

source: Dropdown
ms: Juntai Bawah
th: รายการแบบเลือก

source: Checkbox
ms: Kotak Semak
th: ช่องทำเครื่องหมาย

source: File
ms: Fail
th: ไฟล์

source: Required
ms: Diperlukan
th: จำเป็น

source: Move up
ms: Alih ke atas
th: ย้ายขึ้น

source: Move down
ms: Alih ke bawah
th: ย้ายลง

# onlyOwnerCanCreateTemplate
source: Only workspace owner or admin can create templates
ms: Hanya pemilik atau pentadbir ruang kerja boleh mencipta templat
th: เฉพาะเจ้าของหรือผู้ดูแลพื้นที่ทำงานเท่านั้นที่สามารถสร้างเทมเพลต

source: Generation Failed
ms: Penjanaan Gagal
th: การสร้างล้มเหลว

# aiConfigApplied
source: Applied AI configuration: {scenario}
ms: Konfigurasi AI digunakan: {scenario}
th: ใช้การตั้งค่า AI: {scenario}

source: Add Field
ms: Tambah Medan
th: เพิ่มฟิลด์

source: Edit Field
ms: Edit Medan
th: แก้ไขฟิลด์

source: Field Label
ms: Label Medan
th: ป้ายกำกับฟิลด์

source: Field Type
ms: Jenis Medan
th: ประเภทฟิลด์

# placeholder
source: Placeholder (Optional)
ms: Teks Pemegang Tempat (Pilihan)
th: ข้อความตัวอย่าง (ไม่บังคับ)

# hintText
source: Hint text for this field
ms: Teks petunjuk untuk medan ini
th: ข้อความคำแนะนำสำหรับฟิลด์นี้

source: Dropdown Options
ms: Pilihan Juntai Bawah
th: ตัวเลือกรายการแบบเลือก

source: Add Option
ms: Tambah Pilihan
th: เพิ่มตัวเลือก

source: Checked by default
ms: Disemak secara lalai
th: เลือกโดยค่าเริ่มต้น

source: Required Field
ms: Medan Diperlukan
th: ฟิลด์ที่จำเป็น

# usersMustFill
source: Users must fill this field
ms: Pengguna mesti mengisi medan ini
th: ผู้ใช้ต้องกรอกฟิลด์นี้

source: Save Changes
ms: Simpan Perubahan
th: บันทึกการเปลี่ยนแปลง

# pleaseEnterTemplateName
source: Please enter a template name
ms: Sila masukkan nama templat
th: กรุณากรอกชื่อเทมเพลต

# pleaseEnterFieldLabel
source: Please enter a field label
ms: Sila masukkan label medan
th: กรุณากรอกป้ายกำกับฟิลด์

# pleaseAddDropdownOption
source: Please add at least one dropdown option
ms: Sila tambah sekurang-kurangnya satu pilihan juntai bawah
th: กรุณาเพิ่มตัวเลือกรายการแบบเลือกอย่างน้อยหนึ่งตัว

# pleaseAddOneField
source: Please add at least one field
ms: Sila tambah sekurang-kurangnya satu medan
th: กรุณาเพิ่มฟิลด์อย่างน้อยหนึ่งฟิลด์

source: Template created successfully
ms: Templat berjaya dicipta
th: สร้างเทมเพลตสำเร็จ

# failedToCreateTemplate
source: Failed to create template. Please try again.
ms: Gagal mencipta templat. Sila cuba lagi.
th: ไม่สามารถสร้างเทมเพลต กรุณาลองอีกครั้ง

# approvalStep
source: Approval Step {level}
ms: Langkah Kelulusan {level}
th: ขั้นตอนการอนุมัติ {level}

# addApproversForStep
source: Add approvers for this step
ms: Tambah pelulus untuk langkah ini
th: เพิ่มผู้อนุมัติสำหรับขั้นตอนนี้

source: Step Name
ms: Nama Langkah
th: ชื่อขั้นตอน

# noWorkspaceMembers
source: No workspace members available. Please add members first.
ms: Tiada ahli ruang kerja tersedia. Sila tambah ahli terlebih dahulu.
th: ไม่มีสมาชิกพื้นที่ทำงาน กรุณาเพิ่มสมาชิกก่อน

source: Select Approver
ms: Pilih Pelulus
th: เลือกผู้อนุมัติ

# chooseFromMembers
source: Choose from workspace members
ms: Pilih dari ahli ruang kerja
th: เลือกจากสมาชิกพื้นที่ทำงาน

source: Owner
ms: Pemilik
th: เจ้าของ

source: Require all approvers
ms: Perlukan semua pelulus
th: ต้องการผู้อนุมัติทั้งหมด

# everyoneMustApprove
source: Everyone must approve to proceed
ms: Semua orang mesti meluluskan untuk meneruskan
th: ทุกคนต้องอนุมัติเพื่อดำเนินการต่อ

# pleaseEnterStepName
source: Please enter a step name
ms: Sila masukkan nama langkah
th: กรุณากรอกชื่อขั้นตอน

# pleaseAddOneApprover
source: Please add at least one approver
ms: Sila tambah sekurang-kurangnya seorang pelulus
th: กรุณาเพิ่มผู้อนุมัติอย่างน้อยหนึ่งคน

source: Delete Template
ms: Padam Templat
th: ลบเทมเพลต

# deleteTemplateConfirmation
source: Are you sure you want to delete "{templateName}"?
ms: Adakah anda pasti mahu memadam "{templateName}"?
th: คุณแน่ใจหรือไม่ว่าต้องการลบ "{templateName}"?

source: Use Template
ms: Guna Templat
th: ใช้เทมเพลต

# fieldCount
source: {count} fields
ms: {count} medan
th: {count} ฟิลด์

# stepCount
source: {count} steps
ms: {count} langkah
th: {count} ขั้นตอน

# templateStatusActive
source: Active
ms: Aktif
th: ใช้งานอยู่

# templateStatusInactive
source: Inactive
ms: Tidak Aktif
th: ไม่ใช้งาน

# briefDescriptionOfTemplate
source: Brief description of this template
ms: Penerangan ringkas tentang templat ini
th: รายละเอียดสั้นๆ ของเทมเพลตนี้

source: eG,
ms: cth.
th: เช่น

# eGdepartment
source: eG, Department, Amount
ms: cth., Jabatan, Jumlah
th: เช่น แผนก, จำนวนเงิน

source: eG, Marketing
ms: cth., Pemasaran
th: เช่น การตลาด

# eGmanager
source: eG, Manager Review
ms: cth., Semakan Pengurus
th: เช่น การตรวจสอบของผู้จัดการ

# eGbudget
source: eG, Budget Approval
ms: cth., Kelulusan Bajet
th: เช่น การอนุมัติงบประมาณ

source: New Request
ms: Permohonan Baharu
th: คำขอใหม่

source: Request Details
ms: Butiran Permohonan
th: รายละเอียดคำขอ

source: Submit Request
ms: Hantar Permohonan
th: ส่งคำขอ

# templateNotFound
source: Template not found. Please select a template from the list.
ms: Templat tidak ditemui. Sila pilih templat dari senarai.
th: ไม่พบเทมเพลต กรุณาเลือกเทมเพลตจากรายการ

source: No Templates Available
ms: Tiada Templat Tersedia
th: ไม่มีเทมเพลต

# createTemplateFirst
source: Create a template first to submit a request
ms: Cipta templat terlebih dahulu untuk menghantar permohonan
th: สร้างเทมเพลตก่อนเพื่อส่งคำขอ

source: Change
ms: Tukar
th: เปลี่ยน

source: Approval Flow
ms: Aliran Kelulusan
th: ขั้นตอนการอนุมัติ

# approverCount
source: {count} approver(s)
ms: {count} pelulus
th: {count} ผู้อนุมัติ

# selectDate
source: Select a date
ms: Pilih tarikh
th: เลือกวันที่

# selectOption
source: Select an option
ms: Pilih pilihan
th: เลือกตัวเลือก

# attachFile
source: Attach a file
ms: Lampirkan fail
th: แนบไฟล์

source: File upload coming soon
ms: Muat naik fail akan datang tidak lama lagi
th: การอัปโหลดไฟล์จะเปิดใช้งานเร็วๆ นี้

# pleaseFillField
source: Please fill in {fieldName}
ms: Sila isi {fieldName}
th: กรุณากรอก {fieldName}

source: Request submitted successfully
ms: Permohonan berjaya dihantar
th: ส่งคำขอสำเร็จ

source: Export PDF
ms: Eksport PDF
th: ส่งออก PDF

# noWorkspaceSelectedError
source: No workspace selected
ms: Tiada ruang kerja dipilih
th: ยังไม่ได้เลือกพื้นที่ทำงาน

source: Approve Request
ms: Luluskan Permohonan
th: อนุมัติคำขอ

source: Reject Request
ms: Tolak Permohonan
th: ปฏิเสธคำขอ

source: Reason (required)
ms: Sebab (diperlukan)
th: เหตุผล (จำเป็น)

source: Comment (optional)
ms: Komen (pilihan)
th: ความคิดเห็น (ไม่บังคับ)

source: Request approved ✓
ms: Permohonan diluluskan ✓
th: อนุมัติคำขอแล้ว ✓

source: Request rejected
ms: Permohonan ditolak
th: ปฏิเสธคำขอแล้ว

# submittedBy
source: Submitted by {name}
ms: Dihantar oleh {name}
th: ส่งโดย {name}

# noFieldData
source: No field data available
ms: Tiada data medan tersedia
th: ไม่มีข้อมูลฟิลด์

source: Approval History
ms: Sejarah Kelulusan
th: ประวัติการอนุมัติ

source: Reject
ms: Tolak
th: ปฏิเสธ

source: Approve
ms: Luluskan
th: อนุมัติ

source: Draft
ms: Draf
th: ร่าง

source: Pending
ms: Tertunda
th: รอดำเนินการ

source: Approved
ms: Diluluskan
th: อนุมัติแล้ว

source: Rejected
ms: Ditolak
th: ปฏิเสธแล้ว

source: Revised
ms: Disesuaikan
th: แก้ไขแล้ว

source: Attachment provided
ms: Lampiran disediakan
th: มีไฟล์แนบ

source: Status
th: สถานะ

source: Notification
ms: Pemberitahuan
th: การแจ้งเตือน

source: Mark all read
ms: Tanda semua sebagai dibaca
th: อ่านทั้งหมด

source: No Notifications
ms: Tiada Pemberitahuan
th: ไม่มีการแจ้งเตือน

# allCaughtUp
source: You're all caught up!
ms: Anda sudah mengikut perkembangan!
th: คุณตามทันแล้ว!

# noFilteredNotifications
source: No {filter} notifications
ms: Tiada pemberitahuan {filter}
th: ไม่มีการแจ้งเตือน {filter}

source: All
ms: Semua
th: ทั้งหมด

source: Invitations
ms: Jemputan
th: คำเชิญ

source: Invitation dismissed
ms: Jemputan dibuang
th: ปิดคำเชิญแล้ว

source: Workspace Invitation
ms: Jemputan Ruang Kerja
th: คำเชิญเข้าร่วมพื้นที่ทำงาน

# invitedYou
source: {name} invited you to join this workspace
ms: {name} menjemput anda untuk menyertai ruang kerja ini
th: {name} เชิญคุณเข้าร่วมพื้นที่ทำงานนี้

source: Decline
ms: Tolak
th: ปฏิเสธ

source: Accept
ms: Terima
th: ยอมรับ

source: Notification dismissed
ms: Pemberitahuan dibuang
th: ปิดการแจ้งเตือนแล้ว

# openingRequest
source: Opening request {requestId}...
ms: Membuka permohonan {requestId}...
th: กำลังเปิดคำขอ {requestId}...

source: Invitation accepted!
ms: Jemputan diterima!
th: ยอมรับคำเชิญแล้ว!

# failedToAcceptInvitation
source: Failed to accept invitation: {error}
ms: Gagal menerima jemputan: {error}
th: ไม่สามารถยอมรับคำเชิญ: {error}

source: Unable to accept invitation
ms: Tidak dapat menerima jemputan
th: ไม่สามารถยอมรับคำเชิญได้

source: Unable to decline invitation
ms: Tidak dapat menolak jemputan
th: ไม่สามารถปฏิเสธคำเชิญได้

source: Invitation declined
ms: Jemputan ditolak
th: ปฏิเสธคำเชิญแล้ว

# failedToDeclineInvitation
source: Failed to decline invitation: {error}
ms: Gagal menolak jemputan: {error}
th: ไม่สามารถปฏิเสธคำเชิญ: {error}

source: Just now
ms: Sebentar tadi
th: เมื่อสักครู่

source: Analytics
ms: Analitik
th: การวิเคราะห์

source: Overview
ms: Gambaran Keseluruhan
th: ภาพรวม

source: Trends
ms: Trend
th: แนวโน้ม

source: Performance
ms: Prestasi
th: ประสิทธิภาพ

source: Total Requests
ms: Jumlah Permohonan
th: คำขอทั้งหมด

# pendingCount
source: Pending
ms: Tertunda
th: รอดำเนินการ

# approvedCount
source: Approved
ms: Diluluskan
th: อนุมัติแล้ว

# rejectedCount
source: Rejected
ms: Ditolak
th: ปฏิเสธแล้ว

source: Approval Rate
ms: Kadar Kelulusan
th: อัตราการอนุมัติ

source: No Data
ms: Tiada Data
th: ไม่มีข้อมูล

source: Workspace Info
ms: Maklumat Ruang Kerja
th: ข้อมูลพื้นที่ทำงาน

source: Plan
ms: Pelan
th: แผน

source: Members
ms: Ahli
th: สมาชิก

source: Created
ms: Dicipta
th: สร้างเมื่อ

source: Weekly Activity
ms: Aktiviti Mingguan
th: กิจกรรมประจำสัปดาห์

source: Request Trends
ms: Trend Permohonan
th: แนวโน้มคำขอ

source: Top Performers
ms: Prestasi Terbaik
th: ผู้ทำงานได้ดีที่สุด

# performerStats
source: {approved} approved • {rejected} rejected
ms: {approved} diluluskan • {rejected} ditolak
th: {approved} อนุมัติ • {rejected} ปฏิเสธ

source: Average Approval Time
ms: Purata Masa Kelulusan
th: เวลาการอนุมัติเฉลี่ย

# level
source: Level {level}
ms: Tahap {level}
th: ระดับ {level}

source: Overall
ms: Keseluruhan
th: โดยรวม
