Repository: cs100591/approv-now
Catalog: lib/l10n/app_*.arb
Languages: ms, th

# monday
source: Mon
ms: Isn
th: จ

# tuesday
source: Tue
ms: Sel
th: อ

# wednesday
source: Wed
ms: Rab
th: พ

# thursday
source: Thu
ms: Kha
th: พฤ

# friday
source: Fri
ms: Jum
th: ศ

# saturday
source: Sat
ms: Sab
th: ส

# sunday
source: Sun
ms: Ahd
th: อา

source: View Analytics
ms: Lihat Analitik
th: ดูการวิเคราะห์

source: Export Reports
ms: Eksport Laporan
th: ส่งออกรายงาน

source: Subscription
ms: Langganan
th: การสมัครสมาชิก

source: Upgrade
ms: Naik Taraf
th: อัปเกรด

source: Upgrade Plan
ms: Naik Taraf Pelan
th: อัปเกรดแผน

source: RECOMMENDED
ms: DISYORKAN
th: แนะนำ

# currentPlan
source: Current Plan: {plan}
ms: Pelan Semasa: {plan}
th: แผนปัจจุบัน: {plan}

source: Compare All Plans
ms: Bandingkan Semua Pelan
th: เปรียบเทียบแผนทั้งหมด

source: Maybe Later
ms: Mungkin Kemudian
th: ไว้ภายหลัง

source: Upgrade to {plan}
ms: Naik taraf ke {plan}
th: อัปเกรดเป็น {plan}

source: View Plans
ms: Lihat Pelan
th: ดูแผน

source: Compare Plans
ms: Bandingkan Pelan
th: เปรียบเทียบแผน

# choosePlan
source: Choose the plan that fits your needs
ms: Pilih pelan yang sesuai dengan keperluan anda
th: เลือกแผนที่เหมาะกับความต้องการของคุณ

source: CURRENT
ms: SEMASA
th: ปัจจุบัน

# limitReached
source: Limit reached. Upgrade your plan to add more.
ms: Had dicapai. Naik taraf pelan anda untuk menambah lebih banyak.
th: ถึงขีดจำกัด อัปเกรดแผนของคุณเพื่อเพิ่มเติม

# approachingLimit
source: Approaching limit. Consider upgrading soon.
ms: Menghampiri had. Pertimbangkan untuk menaik taraf tidak lama lagi.
th: ใกล้ถึงขีดจำกัด พิจารณาอัปเกรดเร็วๆ นี้

source: {resource} Limit Reached
ms: Had {resource} Dicapai
th: ถึงขีดจำกัด {resource}

# limitReachedMessage
source: You've reached the maximum number of {resource} allowed by your plan.
ms: Anda telah mencapai bilangan {resource} maksimum yang dibenarkan oleh pelan anda.
th: คุณถึงจำนวน {resource} สูงสุดที่แผนของคุณอนุญาต

source: No recent activity
ms: Tiada aktiviti terkini
th: ไม่มีกิจกรรมล่าสุด

# recentActivityDescription
source: Your requests and approvals will appear here
ms: Permohonan dan kelulusan anda akan dipaparkan di sini
th: คำขอและการอนุมัติของคุณจะปรากฏที่นี่

source: Recent Activity
ms: Aktiviti Terkini
th: กิจกรรมล่าสุด

source: View All
ms: Lihat Semua
th: ดูทั้งหมด

source: {time} ago
ms: {time} yang lalu
th: {time} ที่แล้ว

# minutes
source: m
th: น

# hours
source: h
ms: j
th: ช

# days
source: d
ms: h
th: ว

source: Yesterday
ms: Semalam
th: เมื่อวาน

source: My Pending
ms: Tertunda Saya
th: รอดำเนินการของฉัน

source: To Approve
ms: Untuk Diluluskan
th: ต้องอนุมัติ

source: My Approved
ms: Diluluskan Saya
th: อนุมัติแล้วของฉัน

source: Total
ms: Jumlah
th: ทั้งหมด
